---
kind: other
id: Methods.T:Autodesk.Revit.DB.Electrical.ConduitSizes
source: html/76353e4d-ca89-f9ae-2be9-9341c887da60.htm
---
# ConduitSizes Methods

Checks whether a conduit size with the nominal diameter exists.